In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# 7-1. 통계 함수
## 주요 통계 함수 목록
<img src="img/7강/통계함수.jpg" alt="통계함수" style="width: 400px;"/>

## 주요 함수 옵션
<img src="img/7강/주요함수옵션.jpg" alt="주요옵션" style="width: 400px;"/>

### ** axis는 통계함수 뿐만 아니라, 많은 함수에서 동일하게 적용됨. **

In [2]:
# 샘플 데이터 생성
np.random.seed(0)
df = pd.DataFrame(np.random.randint(50, 100, (5, 6)), 
                  columns=[[2016, 2016, 2016, 2017, 2017, 2017], ['영어','수학', '과학','영어','수학', '과학']], 
                  index = ['Kim','Park','Lee','Jung','Moon'])
df.index.set_names('학생명', inplace = True)
df.columns.set_names(['년도','과목'], inplace = True)
df.loc['Moon', (2016, '과학')] = np.nan

In [4]:
df

년도   2016           2017
과목     영어  수학    과학   영어  수학  과학
학생명
Kim    94  97  50.0   53  53  89
Park   59  69  71.0   86  73  56
Lee    74  74  62.0   51  88  89
Jung   73  96  74.0   67  87  75
Moon   63  58   NaN   70  66  55

In [5]:
# 2016년 성적만 선택해서 df2016에 저장
df2016 = df[2016]
df2016

과목    영어  수학    과학
학생명
Kim   94  97  50.0
Park  59  69  71.0
Lee   74  74  62.0
Jung  73  96  74.0
Moon  63  58   NaN

In [6]:
# 1) count() - NaN 값을 제외한 데이터의 갯수 
df2016.count()

과목
영어    5
수학    5
과학    4
dtype: int64

In [7]:
# 2) sum() - 값의 합을 계산
## 기본적으로 함수는 각 컬럼에 있는 로우(row)들의 값들로 수행됨. (기본값 axis =0) 
## 모든 통계 함수는 동일함.
df2016.sum()

과목
영어    363.0
수학    394.0
과학    257.0
dtype: float64

In [8]:
df2016.sum(axis = 1)

학생명
Kim     241.0
Park    199.0
Lee     210.0
Jung    243.0
Moon    121.0
dtype: float64

In [9]:
# 3) describe() - 각 컬럼에 대한 요약 통계
df2016.describe()

과목            영어         수학         과학
count   5.000000   5.000000   4.000000
mean   72.600000  78.800000  64.250000
std    13.575714  17.166828  10.781929
min    59.000000  58.000000  50.000000
25%    63.000000  69.000000  59.000000
50%    73.000000  74.000000  66.500000
75%    74.000000  96.000000  71.750000
max    94.000000  97.000000  74.000000

In [6]:
df

년도   2016           2017
과목     영어  수학    과학   영어  수학  과학
학생명
Kim    94  97  50.0   53  53  89
Park   59  69  71.0   86  73  56
Lee    74  74  62.0   51  88  89
Jung   73  96  74.0   67  87  75
Moon   63  58   NaN   70  66  55

In [7]:
# 실습. 년도별 과목별 평균 성적을 출력
df.mean()

년도    과목
2016  영어    72.60
      수학    78.80
      과학    64.25
2017  영어    65.40
      수학    73.40
      과학    72.80
dtype: float64

In [8]:
# 실습. 학생별로 모든 년도/과목에 대한 전체 평균을 출력
df.mean(axis = 1)

학생명
Kim     72.666667
Park    69.000000
Lee     73.000000
Jung    78.666667
Moon    62.400000
dtype: float64

In [9]:
df

년도   2016           2017
과목     영어  수학    과학   영어  수학  과학
학생명
Kim    94  97  50.0   53  53  89
Park   59  69  71.0   86  73  56
Lee    74  74  62.0   51  88  89
Jung   73  96  74.0   67  87  75
Moon   63  58   NaN   70  66  55

In [10]:
# 년도별 학생별 평균 구하기 
# 컬럼명이 (2016, '평균')으로 2016년 학생별 평균을 저장.
# 컬럼명이 (2017, '평균')으로 2017년 학생별 평균을 저장.

In [11]:
# 첫번째 방법 - 연도별로 각각 구하기
df[(2016, '평균')] = df[2016].mean(axis = 1)
df[(2017, '평균')] = df[2017].mean(axis = 1)

In [12]:
df.sort_index(axis = 1)

년도    2016                    2017
과목      과학  수학  영어         평균   과학  수학  영어         평균
학생명
Kim   50.0  97  94  80.333333   89  53  53  65.000000
Park  71.0  69  59  66.333333   56  73  86  71.666667
Lee   62.0  74  74  70.000000   89  88  51  76.000000
Jung  74.0  96  73  81.000000   75  87  67  76.333333
Moon   NaN  58  63  60.500000   55  66  70  63.666667

In [ ]:
# 두번째 방법 
# 첫번째 방법은 연도가 매우 많으면 코드가 복잡해므로, 컬럼 인덱스 정보를 활용하여 일반화 하기

In [49]:
df.columns

MultiIndex(levels=[[2016, 2017], ['과학', '수학', '영어', '평균']],
           codes=[[0, 0, 0, 1, 1, 1, 0, 1], [2, 1, 0, 2, 1, 0, 3, 3]],
           names=['년도', '과목'])

In [50]:
# Index.get_level_values(level)함수는 해당 인덱스의 인자로 받은 level의 컬럼값들을 반환해줌.
df.columns.get_level_values(0).unique()

Int64Index([2016, 2017], dtype='int64', name='년도')

In [51]:
# Index.get_level_values(level)함수는 해당 인덱스의 인자로 받은 level의 컬럼값들을 반환해줌.
for col in df.columns.get_level_values(0).unique():
    df[(col, '평균2')] = df[col].mean(axis = 1)

In [52]:
df.sort_index(axis = 1)

년도    2016                               2017
과목      과학  수학  영어         평균        평균2   과학  수학  영어         평균        평균2
학생명
Kim   50.0  97  94  80.333333  80.333333   89  53  53  65.000000  65.000000
Park  71.0  69  59  66.333333  66.333333   56  73  86  71.666667  71.666667
Lee   62.0  74  74  70.000000  70.000000   89  88  51  76.000000  76.000000
Jung  74.0  96  73  81.000000  81.000000   75  87  67  76.333333  76.333333
Moon   NaN  58  63  60.500000  60.500000   55  66  70  63.666667  63.666667

In [ ]:
# Moon의 2016년 평균을 보면, 과학 성적이 제외되고 계산된 것을 알 수 있음.
#왜냐하면 기본 통계함수는 NaN값을 제외하고 처리되기 때문임.
# 미기입된 과학성적을 반영하여 통계를 뽑아 보시오.

In [113]:
# fillna() 함수를 사용하여 NaN 값을 0점으로 변환한 후에 평균을 구하기. (NaN은 해당 데이터가 없다는 뜻이므로 미응시를 뜻한다.)
# 하지만 이 경우, 변환된 데이터에서 시험을 응시하였는데 0점을 받은 것인지, 미응시한 것인지에 대한 구분을 할 수 없다.
# 그러므로 원본데이터가 아닌 복사본에 저장한 후, 평균을 구하는 것이 좋다. 
df2 = df.fillna(0)

In [114]:
for col in df2.columns.get_level_values(0).unique():
    df2[(col, '평균')] = df2[col].mean(axis = 1)

In [115]:
df2.sort_index(axis = 1)

년도    2016                    2017
과목      과학  수학  영어         평균   과학  수학  영어         평균
학생명
Kim   50.0  97  94  80.333333   89  53  53  65.000000
Park  71.0  69  59  66.333333   56  73  86  71.666667
Lee   62.0  74  74  70.000000   89  88  51  76.000000
Jung  74.0  96  73  81.000000   75  87  67  76.333333
Moon   0.0  58  63  40.333333   55  66  70  63.666667

In [118]:
## DataFrame.mean() 함수의 skipna라는 인자는 기본값이 True이며, 이 경우 NaN을 제외하고 계산한다. 
## 만약 skipna를 False로 지정하면, NaN값을 제외하지 않고 계산하므로, 계산 결과가 NaN이 된다. 
# 왜냐하면 산술 연산에 NaN이 하나라도 포함되어 있으면 연산 결과는 NaN이 되기 때문이다. 아래 코드의 주석을 해제하고 실행해보면 이해가 된다. 
# 3 + 5 + np.nan

# 7-2. 정렬
## * 데이터 정렬 : sort_values()
<img src="img/7강/데이터프레임정렬.jpg" alt="DataFrame.sort_values" style="width: 600px;"/>
## * 인덱스 정렬 : sort_index() - 인자는 sort_values()와 동일
### http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values

## 1) Series 정렬

In [14]:
# Series 정렬을 위한 샘플 데이터
sr = Series([3,5,2,1,7,10], index = list('bcafed'))
sr

b     3
c     5
a     2
f     1
e     7
d    10
dtype: int64

In [15]:
# 로우 인덱스 라벨의 값으로 정렬
sr.sort_index()

a     2
b     3
c     5
d    10
e     7
f     1
dtype: int64

In [16]:
# Series의 값으로 정렬 (기본값 = 오름차순)
sr.sort_values()

f     1
a     2
b     3
c     5
e     7
d    10
dtype: int64

In [17]:
# Series의 값으로 내림차순 정렬
sr.sort_values(ascending = False)

d    10
e     7
c     5
b     3
a     2
f     1
dtype: int64

## 2) DataFrame 정렬

In [18]:
df2016

과목    영어  수학
학생명
Kim   94  97
Park  53  89
Lee   71  86
Jung  74  74
Moon  88  89

In [13]:
df2016.sort_index()

과목    영어  수학    과학
학생명
Jung  73  96  74.0
Kim   94  97  50.0
Lee   74  74  62.0
Moon  63  58   NaN
Park  59  69  71.0

In [14]:
# 수학 성적으로 오른차순 정렬
df2016.sort_values(by = '수학')

과목    영어  수학    과학
학생명
Moon  63  58   NaN
Park  59  69  71.0
Lee   74  74  62.0
Jung  73  96  74.0
Kim   94  97  50.0

In [21]:
# 실습. 영어 성적의 내림차순 정렬
df2016.sort_values(by = '영어', ascending = False)

과목    영어  수학
학생명
Kim   94  97
Moon  88  89
Jung  74  74
Lee   71  86
Park  53  89

In [22]:
## 3) 계층 색인 데이터프레임 정렬
df

년도   2016     2017
과목     영어  수학   영어  수학
학생명
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

In [15]:
# 실습. 2017년 수학 성적 기준으로 내림차순 정렬
df.sort_values(by = (2017, '수학'), ascending = False)

년도   2016           2017               2016       2017
과목     영어  수학    과학   영어  수학  과학         평균         평균
학생명
Lee    74  74  62.0   51  88  89  70.000000  76.000000
Jung   73  96  74.0   67  87  75  81.000000  76.333333
Park   59  69  71.0   86  73  56  66.333333  71.666667
Moon   63  58   NaN   70  66  55  60.500000  63.666667
Kim    94  97  50.0   53  53  89  80.333333  65.000000

In [24]:
# 정렬 결과 저장
df.sort_values(by = (2017, '수학'), ascending = False, inplace = True)